#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Метод возвращает данные о статусе торговли по инструменты
// 
// Параметры:
//  InstrumentId - Строка - ID инструмента или figi.
//  Песочница - Булево - Ложь, если это не песочница.
//  
// Возвращаемое значение:
//  Произвольный - Массив структур ответа данного запроса
//  
Функция GetTradingStatuses(InstrumentId, Песочница = Ложь) Экспорт
	
	URL = "https://invest-public-api.tinkoff.ru/rest/tinkoff.public.invest.api.contract.v1.MarketDataService/GetTradingStatuses";
	
	ПараметрыТелаЗапроса = Новый Структура();
	ПараметрыТелаЗапроса.Вставить("instrumentId", instrumentId);
	
	ТелоЗапроса = "	{
					|	'instrumentId': [
					|		[instrumentId]
					|	]
					|}";
					
	ТелоЗапроса = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТелоЗапроса, ПараметрыТелаЗапроса);
	
	Ответ = TrBЗапросыTinkoff.ЗапросВТинькоффИнвестиции(URL, ТелоЗапроса, Песочница);
	
	Ответ.Содержимое = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Ответ.Содержимое);
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
