#Область ПрограммныйИнтерфейс

// Функция возвращает данные о статусе торговли по инструменты
// Параметры:
//  InstrumentId - Строка - ID инструмента или figi.
//  Песочница - Булево - Ложь, если это не песочница.
// Возвращаемое значение:
//  Произвольный - Массив структур ответа данного запроса
//  
Функция GetTradingStatuses(InstrumentId, Песочница = Ложь) Экспорт
	
	URL = "https://invest-public-api.tinkoff.ru/rest/tinkoff.public.invest.api.contract.v1.MarketDataService/GetTradingStatuses";
	
	ПараметрыТелаЗапроса = Новый Структура();
	ПараметрыТелаЗапроса.Вставить("instrumentId", instrumentId);
	
	ТелоЗапроса = "	{
					|	'instrumentId': [
					|		[instrumentId]
					|	]
					|}";
					
	ТелоЗапроса = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТелоЗапроса, ПараметрыТелаЗапроса);
	
	Ответ = ЗапросВТинькоффИнвестиции(URL, ТелоЗапроса, Песочница);
	
	Ответ.Содержимое = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Ответ.Содержимое);
	
	Возврат Ответ;
	
КонецФункции

// Функция 
// Параметры:
//  
//  Песочница - Булево - Ложь, если это не песочница.
// Возвращаемое значение:
//  Произвольный - Массив структур ответа данного запроса
//  
Функция ЛюбаяФункци1(Песочница = Ложь) Экспорт
	
	URL = "";
	
	ПараметрыТелаЗапроса = Новый Структура();
	ПараметрыТелаЗапроса.Вставить("", "");
	
	ТелоЗапроса = "";
					
	ТелоЗапроса = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТелоЗапроса, ПараметрыТелаЗапроса);
	
	Ответ = ЗапросВТинькоффИнвестиции(URL, ТелоЗапроса, Песочница);
	
	Ответ.Содержимое = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Ответ.Содержимое);
	
	Возврат Ответ;
	
КонецФункции

// Функция 
// Параметры:
//  
//  Песочница - Булево - Ложь, если это не песочница.
// Возвращаемое значение:
//  Произвольный - Массив структур ответа данного запроса
//  
Функция ЛюбаяФункци2(Песочница = Ложь) Экспорт
	
	URL = "";
	
	ПараметрыТелаЗапроса = Новый Структура();
	ПараметрыТелаЗапроса.Вставить("", "");
	
	ТелоЗапроса = "";
					
	ТелоЗапроса = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТелоЗапроса, ПараметрыТелаЗапроса);
	
	Ответ = ЗапросВТинькоффИнвестиции(URL, ТелоЗапроса, Песочница);
	
	Ответ.Содержимое = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Ответ.Содержимое);
	
	Возврат Ответ;
	
КонецФункции

// Функция 
// Параметры:
//  
//  Песочница - Булево - Ложь, если это не песочница.
// Возвращаемое значение:
//  Произвольный - Массив структур ответа данного запроса
//  
Функция ЛюбаяФункци3(Песочница = Ложь) Экспорт
	
	URL = "";
	
	ПараметрыТелаЗапроса = Новый Структура();
	ПараметрыТелаЗапроса.Вставить("", "");
	
	ТелоЗапроса = "";
					
	ТелоЗапроса = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТелоЗапроса, ПараметрыТелаЗапроса);
	
	Ответ = ЗапросВТинькоффИнвестиции(URL, ТелоЗапроса, Песочница);
	
	Ответ.Содержимое = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(Ответ.Содержимое);
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ЗапросВТинькоффИнвестиции(URL, ТелоЗапроса, Песочница = Ложь)
	
	Если Песочница Тогда
		Токен = Константы.TrBТокенПесочница.Получить();	
	Иначе
		Токен = Константы.TrBТокен.Получить();
	КонецЕсли;
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("accept", "application/json");
	Заголовки.Вставить("Authorization", Токен);
	Заголовки.Вставить("Content-Type", "application/json");
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ФорматОтвета"				, 1);
	ПараметрыЗапроса.Вставить("Метод"						, "POST");
	ПараметрыЗапроса.Вставить("ДанныеДляОбработки"			, ТелоЗапроса);
	ПараметрыЗапроса.Вставить("ФорматДанныхДляОбработки"	, 1);
	ПараметрыЗапроса.Вставить("Заголовки"					, Заголовки);
	ПараметрыЗапроса.Вставить("ИмяФайлаОтвета"				, Неопределено);
	ПараметрыЗапроса.Вставить("Таймаут"						, -1);
	ПараметрыЗапроса.Вставить("НастройкиПрокси"				, Неопределено);
	
	Возврат ИнтернетПоддержкаПользователей.ЗагрузитьСодержимоеИзИнтернет(URL, , , ПараметрыЗапроса);
	
КонецФункции

#КонецОбласти