// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура NATS(Команда)
	NATSНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура NATSНаСервере()
	СтрокаЗапрос = TrBNATSКоннектор.КонструкторЗапросаКСервисуNATS("https://demo.nats.io:8222/connz?state=closed");
	ОтветНаЗапрос = Коннектор.Get(СтрокаЗапрос);
	ОбъектТела = Коннектор.JsonВОбъект(ОтветНаЗапрос.Тело);
	Структура = Новый Структура;
	Если ТипЗнч(ОбъектТела) = Тип("Соответствие") Тогда
		TrBОбщегоНазначения.СоответствиеВСтруктуру(ОбъектТела, Структура);
	КонецЕсли;

	СглаженноеСоответствие = Новый Соответствие();
	TrBОбщегоНазначения.СглаживаниеСоответствия(ОбъектТела, СглаженноеСоответствие);
	
	РегистрыСведений.TrBGeneralInformationNATS.ЗаписатьДанные(СглаженноеСоответствие);
КонецПроцедуры
#КонецОбласти

