#Область ПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ЗапросВТинькоффИнвестиции(URL, ТелоЗапроса, Песочница = Ложь) Экспорт
	
	Если Песочница Тогда
		Токен = Константы.TrBТокенПесочница.Получить();	
	Иначе
		Токен = Константы.TrBТокен.Получить();
	КонецЕсли;
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("accept", "application/json");
	Заголовки.Вставить("Authorization", Токен);
	Заголовки.Вставить("Content-Type", "application/json");
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ФорматОтвета"				, 1);
	ПараметрыЗапроса.Вставить("Метод"						, "POST");
	ПараметрыЗапроса.Вставить("ДанныеДляОбработки"			, ТелоЗапроса);
	ПараметрыЗапроса.Вставить("ФорматДанныхДляОбработки"	, 1);
	ПараметрыЗапроса.Вставить("Заголовки"					, Заголовки);
	ПараметрыЗапроса.Вставить("ИмяФайлаОтвета"				, Неопределено);
	ПараметрыЗапроса.Вставить("Таймаут"						, -1);
	ПараметрыЗапроса.Вставить("НастройкиПрокси"				, Неопределено);
	
	Возврат ИнтернетПоддержкаПользователей.ЗагрузитьСодержимоеИзИнтернет(URL, , , ПараметрыЗапроса);
	
КонецФункции

#КонецОбласти