// @strict-types


#Область ПрограммныйИнтерфейс

Процедура Заполнить() Экспорт
	
	Запрос = TrBСервисИнструментов.Shares(Перечисления.TrBItrumentStatus.INSTRUMENT_STATUS_BASE);
	
	СтруктураАкций = TrBОбщегоНазначения.JsonВСтруктуру(Запрос.Содержимое);
	
	Для каждого Элемент Из СтруктураАкций.Instruments Цикл
		Акция = Справочники.TrBShare.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств (Акция, Элемент);
		Акция.Записать();
	КонецЦикла;	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
