// @strict-types


#Область ПрограммныйИнтерфейс

// Преобразует строку в формате JSON в структуру. 
//
// Параметры:
//  СтрокаJSON - Строка - строка в формате JSON.
//
Функция JsonВСтруктуру(СтрокаJSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);

	СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);

	Возврат СтруктураJSON;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
